perf/bbox9091.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
   
  phases:
  - name: Rampa-a-100
    duration: 30
    arrivalRate: 1
    rampTo: 100
  - name: Plano-en-100
    duration: 5
    arrivalRate: 100
  - name: Rampa-a-200
    duration: 30
    arrivalRate: 100
    rampTo: 200
  - name: Plano-en-200
    duration: 5
    arrivalRate: 200

scenarios:
  - name: bbox9091 (/)
    flow:
      - get:
          url: '/bbox9091'