perf/heavy.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      http:
        timeout: 60
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 60 
      arrivalRate: 1
      rampTo: 20
    - name: Plain
      duration: 30
      arrivalRate: 20
    
scenarios:
  - name: Heavy (/)
    flow:
      - get:
          url: '/heavy'